ZGHVER/stm32h750/emwin/emWin/Config/LCDConf_Lin_Template.c
/*
*********************************************************************************************************
*
*	模块名称 : emWin的底层驱动文件
*	文件名称 : LCDConf_Lin_Template.c
*	版    本 : V1.0 
*	说    明 : LCD的部分驱动和emWin底层接口都在这个文件实现。
*              使用说明：
*                1. 此驱动自适应安富莱4.3寸，5寸和7寸屏。
*                2. 用户使用emWin前，请先使能STM32的CRC时钟，之后调用GUI_Init()即可使用emWin。
*                3. 不同的显示屏对用的触摸驱动不同，用户自己使用的话，请周期性调用即可。
*                   电阻屏是：TOUCH_Scan()，1ms调用一次。
*                   电容屏是：GT911_OnePiontScan()，GT811_OnePiontScan()或者FT5X06_OnePiontScan()，10ms调用一次。
*              配置说明：
*                1. H7的图层是由背景层，图层1和图层2组成。
*                2. 程序中对每个配置选项都有详细说明。
*              移植说明：
*                  注意以下三点即可：
*                1. 提供函数LCD_SetBackLight，实现背光的开关。
*                2. 定义全局变量g_LcdWidth和g_LcdHeight。
*                3. 修改函数LCD_ConfigLTDC，修改本文件中函数LCD_LL_Init里面的时序参数。
*
*	修改记录 :
*		版本号    日期         作者        说明
*		V1.0    2019-05-25    Eric2013     首发
*
*
*	Copyright (C), 2019-2030, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/
#include "bsp.h"
#include "GUI.h"
#include "stm32h7xx.h"
#include "GUI_Private.h"
#include "GUIDRV_Lin.h"
#include "BSP/lcd/bsp_lcd.h"

uint32_t g_LcdHeight;
uint32_t g_LcdWidth;


/*
**********************************************************************************************************
							调用外部文件的变量和函数(bsp_tft_429.c文件)
**********************************************************************************************************
*/
typedef struct
{
  int32_t      address;          
  __IO int32_t      pending_buffer;   
  int32_t      buffer_index;     
  int32_t      xSize;            
  int32_t      ySize;            
  int32_t      BytesPerPixel;
  LCD_API_COLOR_CONV   *pColorConvAPI;
}LCD_LayerPropTypedef;

/*
**********************************************************************************************************
									用户可以配置的选项
**********************************************************************************************************
*/
/* 0 暂时用不到这几个功能 */
#define DrawBitmapA4Enalbe    0
#define ClearCacheHookEnalbe  0

/* 
  1. 显示屏的物理分辨率，驱动已经做了显示屏自适应，支持4.3寸，5寸和7寸屏
     这里填写自适应显示屏中的最大分辨率。
*/
#define XSIZE_PHYS       800
#define YSIZE_PHYS       480

/* 2. 旋转方向，暂未使用此选项，直接在工程运行时做旋转即可 */
#define ROTATION_0       0
#define ROTATION_CW      1
#define ROTATION_180     2
#define ROTATION_CCW     3

/* 
   3. STM32H7支持的颜色模式。
      (1) 如果打算使用24位色或者32位色，请选择CMS_ARGB8888，如果使用16位色，请选择CMS_RGB565，其它颜色格式不再做支持。
	  (2) 如果用户选择了ARGB8888或者RGB888模式，LCD闪烁的话，优先查看是否是此贴的问题：
	      http://forum.armfly.com/forum.php?mod=viewthread&tid=16892 （适用于F429和H7系列）
		  如果不是这个问题，再降低LTDC输出时钟即可，在本文件的函数LCD_ConfigLTDC里面    
*/
#define CMS_ARGB8888 1
#define CMS_RGB888   2
#define CMS_RGB565   3
#define CMS_ARGB1555 4
#define CMS_ARGB4444 5
#define CMS_L8       6
#define CMS_AL44     7
#define CMS_AL88     8

/* 4. 多缓冲 / 虚拟屏，多缓冲和虚拟屏不可同时使用，emWin不支持 */
#define NUM_BUFFERS      3 /* 定义多缓冲个数，仅可以设置1,2和3，也就是最大支持三缓冲 */
#define NUM_VSCREENS     1 /* 定义虚拟屏个数 */

/* 
   5. 重定义图层数，对于STM32H7，用户可以选择一个图层或者两个图层，不支持三图层 
      (1). 设置GUI_NUM_LAYERS = 1时，即仅使用图层1时，默认触摸值是发送给图层1的。
	  (2). 设置GUI_NUM_LAYERS = 2时，即图层1和图层2都已经使能，此时图层2是顶层，
	       用户需要根据自己的使用情况设置如下两个地方。
		   a. 在bsp_touch.c文件中的函数TOUCH_InitHard里面设置参数State.Layer = 1，1就表示
		      给图层2发送触摸值。
		   b. 调用GUI_Init函数后，调用函数GUI_SelectLayer(1), 设置当前操作的是图层2。
*/
#undef  GUI_NUM_LAYERS
#define GUI_NUM_LAYERS 1

/* 
   6. 设置图层1和图层2对应的显存地址
      (1) EXT_SDRAM_ADDR 是SDRAM的首地址。
      (2) LCD_LAYER0_FRAME_BUFFER 是图层1的显存地址。
	  (3) LCD_LAYER1_FRAME_BUFFER 是图层2的显存地址。
	  (4) 每个图层的显存大小比较考究，这里进行下简单的说明。
	      如果用户选择的颜色模式 = 32位色ARGB8888，显存的大小：
	      XSIZE_PHYS * YSIZE_PHYS * 4 * NUM_VSCREENS * NUM_BUFFERS
		  
	      颜色模式 = 24位色RGB888，显存的大小：
	      XSIZE_PHYS * YSIZE_PHYS * 3 * NUM_VSCREENS * NUM_BUFFERS
		  
	      颜色模式 = 16位色RGB566，ARGB1555, ARGB4444，AL88，那么显存的大小就是：
	      XSIZE_PHYS * YSIZE_PHYS * 2 * NUM_VSCREENS * NUM_BUFFERS

	      颜色模式 = 8位色L8，AL44，那么显存的大小就是：
	      XSIZE_PHYS * YSIZE_PHYS * 1 * NUM_VSCREENS * NUM_BUFFERS	
      
      这里为了方便起见，将开发板配套的16MB的SDRAM前8MB分配给LCD显存使用，后8MB用于emWin动态内存。
	  对于24位色，16位色，8位色，用户可以对其使能三缓冲，并且使能双图层。但是32位色也使能三缓冲和双
	  图层的话会超出8MB，所以用户根据自己的情况做显存和emWin动态内存的分配调整。
	    举一个例子，对于800*480分辨率的显示屏，使能32位色，三缓冲，那么最终一个图层需要的大小就是
      800 * 480 * 4 * 3  = 4.394MB的空间，如果是双图层，已经超出8MB的分配范围。

      (5)为了方便起见，图层2的宏定义LCD_LAYER1_FRAME_BUFFER中的参数4是按照32位色设置的，如果用户的图层1
         使用的是8位色，这里填数字1,如果是16位色，这里填2，如果是24位色，这里填3。
*/
#define LCD_LAYER0_FRAME_BUFFER  0xD0000000
#define LCD_LAYER1_FRAME_BUFFER  0xD0177000


/* 7. 配置图层1的颜色模式和分辨率大小 */
#define COLOR_MODE_0  CMS_ARGB8888
#define ORIENTATION_0 ROTATION_0
#define XSIZE_0       XSIZE_PHYS
#define YSIZE_0       YSIZE_PHYS

/* 8. 配置图层2的的颜色模式和分辨率大小 */
#define COLOR_MODE_1  CMS_ARGB8888
#define ORIENTATION_1 ROTATION_0
#define XSIZE_1       XSIZE_PHYS
#define YSIZE_1       YSIZE_PHYS

/* 9. 没有图层激活时，背景色设置, 暂时未用到 */
#define BK_COLOR      GUI_DARKBLUE


/* 10. 单图层情况下，根据用户选择的颜色模式可自动选择图层1的emWin的颜色模式 */
#if   (COLOR_MODE_0 == CMS_ARGB8888)
  #define COLOR_CONVERSION_0 GUICC_M8888I
#elif (COLOR_MODE_0 == CMS_RGB888)
  #define COLOR_CONVERSION_0 GUICC_M888
#elif (COLOR_MODE_0 == CMS_RGB565)
  #define COLOR_CONVERSION_0 GUICC_M565
#elif (COLOR_MODE_0 == CMS_ARGB1555)
  #define COLOR_CONVERSION_0 GUICC_M1555I
#elif (COLOR_MODE_0 == CMS_ARGB4444)
  #define COLOR_CONVERSION_0 GUICC_M4444I
#elif (COLOR_MODE_0 == CMS_L8)
  #define COLOR_CONVERSION_0 GUICC_8666
#elif (COLOR_MODE_0 == CMS_AL44)
  #define COLOR_CONVERSION_0 GUICC_1616I
#elif (COLOR_MODE_0 == CMS_AL88)
  #define COLOR_CONVERSION_0 GUICC_88666I
#else
  #error Illegal color mode 0!
#endif

/* 11. 单图层情况下，根据用户选择的颜色模式可自动选择图层1的emWin的驱动 */
#if   (COLOR_MODE_0 == CMS_ARGB8888)
  #if   (ORIENTATION_0 == ROTATION_0)
    #define DISPLAY_DRIVER_0   GUIDRV_LIN_32
  #elif (ORIENTATION_0 == ROTATION_CW)
    #define DISPLAY_DRIVER_0   GUIDRV_LIN_OSX_32
  #elif (ORIENTATION_0 == ROTATION_180)
    #define DISPLAY_DRIVER_0   GUIDRV_LIN_OXY_32
  #elif (ORIENTATION_0 == ROTATION_CCW)
    #define DISPLAY_DRIVER_0   GUIDRV_LIN_OSY_32
  #endif
#elif (COLOR_MODE_0 == CMS_RGB888)
  #if   (ORIENTATION_0 == ROTATION_0)
    #define DISPLAY_DRIVER_0   GUIDRV_LIN_24
  #elif (ORIENTATION_0 == ROTATION_CW)
    #define DISPLAY_DRIVER_0   GUIDRV_LIN_OSX_24
  #elif (ORIENTATION_0 == ROTATION_180)
    #define DISPLAY_DRIVER_0   GUIDRV_LIN_OXY_24
  #elif (ORIENTATION_0 == ROTATION_CCW)
    #define DISPLAY_DRIVER_0   GUIDRV_LIN_OSY_24
  #endif
#elif (COLOR_MODE_0 == CMS_RGB565)   \
   || (COLOR_MODE_0 == CMS_ARGB1555) \
   || (COLOR_MODE_0 == CMS_ARGB4444) \
   || (COLOR_MODE_0 == CMS_AL88)
  #if   (ORIENTATION_0 == ROTATION_0)
    #define DISPLAY_DRIVER_0   GUIDRV_LIN_16
  #elif (ORIENTATION_0 == ROTATION_CW)
    #define DISPLAY_DRIVER_0   GUIDRV_LIN_OSX_16
  #elif (ORIENTATION_0 == ROTATION_180)
    #define DISPLAY_DRIVER_0   GUIDRV_LIN_OXY_16
  #elif (ORIENTATION_0 == ROTATION_CCW)
    #define DISPLAY_DRIVER_0   GUIDRV_LIN_OSY_16
  #endif
#elif (COLOR_MODE_0 == CMS_L8)   \
   || (COLOR_MODE_0 == CMS_AL44)
  #if   (ORIENTATION_0 == ROTATION_0)
    #define DISPLAY_DRIVER_0   GUIDRV_LIN_8
  #elif (ORIENTATION_0 == ROTATION_CW)
    #define DISPLAY_DRIVER_0   GUIDRV_LIN_OSX_8
  #elif (ORIENTATION_0 == ROTATION_180)
    #define DISPLAY_DRIVER_0   GUIDRV_LIN_OXY_8
  #elif (ORIENTATION_0 == ROTATION_CCW)
    #define DISPLAY_DRIVER_0   GUIDRV_LIN_OSY_8
  #endif
#endif


/* 12. 双图层情况下，根据用户选择的颜色模式可自动选择图层2的emWin的颜色模式 */
#if (GUI_NUM_LAYERS > 1)
#if   (COLOR_MODE_1 == CMS_ARGB8888)
  #define COLOR_CONVERSION_1 GUICC_M8888I
#elif (COLOR_MODE_1 == CMS_RGB888)
  #define COLOR_CONVERSION_1 GUICC_M888
#elif (COLOR_MODE_1 == CMS_RGB565)
  #define COLOR_CONVERSION_1 GUICC_M565
#elif (COLOR_MODE_1 == CMS_ARGB1555)
  #define COLOR_CONVERSION_1 GUICC_M1555I
#elif (COLOR_MODE_1 == CMS_ARGB4444)
  #define COLOR_CONVERSION_1 GUICC_M4444I
#elif (COLOR_MODE_1 == CMS_L8)
  #define COLOR_CONVERSION_1 GUICC_8666
#elif (COLOR_MODE_1 == CMS_AL44)
  #define COLOR_CONVERSION_1 GUICC_1616I
#elif (COLOR_MODE_1 == CMS_AL88)
  #define COLOR_CONVERSION_1 GUICC_88666I
#else
  #error Illegal color mode 0!
#endif

