ZGHVER/stm32h750/emwin/emWin/Config/LCDConf_Lin_Template.c
/*
*********************************************************************************************************
*	函 数 名: _ClearCacheHook
*	功能说明: 清Cache
*	形    参: LayerIndex  图层
*	返 回 值: 无
*********************************************************************************************************
*/
#if ClearCacheHookEnalbe == 1
static void _ClearCacheHook(U32 LayerMask) 
{
	int i;
	for (i = 0; i < GUI_NUM_LAYERS; i++) 
	{
		if (LayerMask & (1 << i)) 
		{
			SCB_CleanDCache_by_Addr ((uint32_t *)_aAddr[i], XSIZE_PHYS * YSIZE_PHYS * sizeof(U32));
		}
	}
}
#endif

/*
*********************************************************************************************************
*	函 数 名: _GetPixelformat
*	功能说明: 获取图层1或者图层2使用的颜色格式
*	形    参: LayerIndex  图层
*	返 回 值: 颜色格式
*********************************************************************************************************
*/
static U32 _GetPixelformat(int LayerIndex) 
{
	const LCD_API_COLOR_CONV * pColorConvAPI;

	if (LayerIndex >= GUI_COUNTOF(_apColorConvAPI)) 
	{
		return 0;
	}
	
	pColorConvAPI = _apColorConvAPI[LayerIndex];
	
	if (pColorConvAPI == GUICC_M8888I) 
	{
		return LTDC_PIXEL_FORMAT_ARGB8888;
	}
	else if (pColorConvAPI == GUICC_M888) 
	{
		return LTDC_PIXEL_FORMAT_RGB888;
	}
	else if (pColorConvAPI == GUICC_M565) 
	{
		return LTDC_PIXEL_FORMAT_RGB565;
	}
	else if (pColorConvAPI == GUICC_M1555I)
	{
		return LTDC_PIXEL_FORMAT_ARGB1555;
	}
	else if (pColorConvAPI == GUICC_M4444I) 
	{
	return LTDC_PIXEL_FORMAT_ARGB4444;
	}
	else if (pColorConvAPI == GUICC_8666  ) 
	{
		return LTDC_PIXEL_FORMAT_L8;
	}
	else if (pColorConvAPI == GUICC_1616I ) 
	{
		return LTDC_PIXEL_FORMAT_AL44;
	}
	else if (pColorConvAPI == GUICC_88666I) 
	{
		return LTDC_PIXEL_FORMAT_AL88;
	}
	
	/* 配置错误会进入这里 */
	while (1);
}

/*
*********************************************************************************************************
*	函 数 名: _GetPixelformat
*	功能说明: 获取图层1或者图层2使用的颜色格式
*	形    参: LayerIndex  图层
*	返 回 值: 颜色格式
*********************************************************************************************************
*/
static void LCD_LL_LayerInit(U32 LayerIndex) 
{  

}

/*
*********************************************************************************************************
*	函 数 名: LCD_LL_Init
*	功能说明: 配置LTDC
*	形    参: 无
*	返 回 值: 无
*   笔    记:
*   
*********************************************************************************************************
*/
static void LCD_LL_Init(void) 
{
	MLCD_Init();
	/* 使能行中断 */
	HAL_LTDC_ProgramLineEvent(&hltdc, 0);
  
    /* 使能Dither */
    HAL_LTDC_EnableDither(&hltdc);

	/* 使能LTDC中断，并配置其优先级 */
	HAL_NVIC_SetPriority(LTDC_IRQn, 0x2, 0);
	HAL_NVIC_EnableIRQ(LTDC_IRQn);
}

/*
*********************************************************************************************************
*	函 数 名: _DMA_Copy
*	功能说明: 通过DMA2D从前景层复制指定区域的颜色数据到目标区域
*	形    参: LayerIndex    图层
*             pSrc          颜色数据源地址
*             pDst          颜色数据目的地址
*             xSize         要复制区域的X轴大小，即每行像素数
*             ySize         要复制区域的Y轴大小，即行数
*             OffLineSrc    前景层图像的行偏移
*             OffLineDst    输出的行偏移
*	返 回 值: 无
*********************************************************************************************************
*/
static void _DMA_Copy(int LayerIndex, void * pSrc, void * pDst, int xSize, int ySize, int OffLineSrc, int OffLineDst) 
{
	U32 PixelFormat;

	/* 获取图层使用的颜色格式 */
	PixelFormat    = _GetPixelformat(LayerIndex);

	/* DMA2D配置 */  
	DMA2D->CR      = 0x00000000UL | (1 << 9);
	DMA2D->FGMAR   = (U32)pSrc;
	DMA2D->OMAR    = (U32)pDst;
	DMA2D->FGOR    = OffLineSrc;
	DMA2D->OOR     = OffLineDst;
	DMA2D->FGPFCCR = PixelFormat;
	DMA2D->NLR     = (U32)(xSize << 16) | (U16)ySize;

	/* 启动传输 */
	DMA2D->CR   |= DMA2D_CR_START;   

	/* 等待DMA2D传输完成 */
	while (DMA2D->CR & DMA2D_CR_START) {} 
}

/*
*********************************************************************************************************
*	函 数 名: _DMA_CopyRGB565
*	功能说明: 通过DMA2D从前景层复制指定区域的颜色数据到目标区域
*	形    参: pSrc          颜色数据源地址
*             pDst          颜色数据目的地址
*             xSize         要复制区域的X轴大小，即每行像素数
*             ySize         要复制区域的Y轴大小，即行数
*             OffLineSrc    前景层图像的行偏移
*             OffLineDst    输出的行偏移
*	返 回 值: 无
*********************************************************************************************************
*/
static void _DMA_CopyRGB565(const void * pSrc, void * pDst, int xSize, int ySize, int OffLineSrc, int OffLineDst)
{
	/* DMA2D配置 */  
	DMA2D->CR      = 0x00000000UL | (1 << 9);
	DMA2D->FGMAR   = (U32)pSrc;
	DMA2D->OMAR    = (U32)pDst;
	DMA2D->FGOR    = OffLineSrc;
	DMA2D->OOR     = OffLineDst;
	DMA2D->FGPFCCR = LTDC_PIXEL_FORMAT_RGB565;
	DMA2D->NLR     = (U32)(xSize << 16) | (U16)ySize;

	/* 启动传输 */
	DMA2D->CR   |= DMA2D_CR_START;   

	/* 等待DMA2D传输完成 */
	while (DMA2D->CR & DMA2D_CR_START) {} 
}

/*
*********************************************************************************************************
*	函 数 名: _DMA_Fill
*	功能说明: 通过DMA2D对于指定区域进行颜色填充
*	形    参: LayerIndex    图层
*             pDst          颜色数据目的地址
*             xSize         要复制区域的X轴大小，即每行像素数
*             ySize         要复制区域的Y轴大小，即行数
*             OffLine       前景层图像的行偏移
*             ColorIndex    要填充的颜色值
*	返 回 值: 无
*********************************************************************************************************
*/
static void _DMA_Fill(int LayerIndex, void * pDst, int xSize, int ySize, int OffLine, U32 ColorIndex) 
{
	U32 PixelFormat;

	/* 获取图层使用的颜色格式 */
	PixelFormat = _GetPixelformat(LayerIndex);

	/* DMA2D配置 */  
	DMA2D->CR      = 0x00030000UL | (1 << 9);
	DMA2D->OCOLR   = ColorIndex;
	DMA2D->OMAR    = (U32)pDst;
	DMA2D->OOR     = OffLine;
	DMA2D->OPFCCR  = PixelFormat;
	DMA2D->NLR     = (U32)(xSize << 16) | (U16)ySize;

	/* 启动传输 */
	DMA2D->CR   |= DMA2D_CR_START;   

	/* 等待DMA2D传输完成 */
	while (DMA2D->CR & DMA2D_CR_START) {} 
}

/*
*********************************************************************************************************
*	函 数 名: _DMA_AlphaBlendingBulk
*	功能说明: 前景层和背景层混合输出
*	形    参: pColorFG    前景层颜色数据地址
*             pColorBG    背景层颜色数据地址
*             pColorDst   输出目标区地址
*             NumItems    转换次数
*	返 回 值: 无
*********************************************************************************************************
*/
static void _DMA_AlphaBlendingBulk(LCD_COLOR * pColorFG, LCD_COLOR * pColorBG, LCD_COLOR * pColorDst, U32 NumItems) 
{  
	/* DMA2D配置 */   
	DMA2D->CR      = 0x00020000UL | (1 << 9);
	DMA2D->FGMAR   = (U32)pColorFG;
	DMA2D->BGMAR   = (U32)pColorBG;
	DMA2D->OMAR    = (U32)pColorDst;
	DMA2D->FGOR    = 0;
	DMA2D->BGOR    = 0;
	DMA2D->OOR     = 0;
	DMA2D->FGPFCCR = LTDC_PIXEL_FORMAT_ARGB8888;
	DMA2D->BGPFCCR = LTDC_PIXEL_FORMAT_ARGB8888;
	DMA2D->OPFCCR  = LTDC_PIXEL_FORMAT_ARGB8888;
	DMA2D->NLR     = (U32)(NumItems << 16) | 1;

	/* 启动传输 */
	DMA2D->CR   |= DMA2D_CR_START;   

	/* 等待DMA2D传输完成 */
	while (DMA2D->CR & DMA2D_CR_START) {} 
}

