ZGHVER/stm32h750/emwin/emWin/Config/LCDConf_Lin_Template.c
/*
*********************************************************************************************************
*	函 数 名: _DMA_MixColorsBulk
*	功能说明: 前景层和背景层混合输出，带Alpha通道设置
*	形    参: pColorFG    前景层颜色数据地址
*             pColorBG    背景层颜色数据地址
*             pColorDst   输出目标区地址
*             Intens      Alpha通道设置
*             NumItems    转换次数
*	返 回 值: 无
*********************************************************************************************************
*/
static void _DMA_MixColorsBulk(LCD_COLOR * pColorFG, LCD_COLOR * pColorBG, LCD_COLOR * pColorDst, U8 Intens, U32 NumItems) 
{
	/* 配置DMA2D */
	DMA2D->CR      = 0x00020000UL | (1 << 9);
	DMA2D->FGMAR   = (U32)pColorFG;
	DMA2D->BGMAR   = (U32)pColorBG;
	DMA2D->OMAR    = (U32)pColorDst;
	DMA2D->FGPFCCR = LTDC_PIXEL_FORMAT_ARGB8888
				 | (1UL << 16)
				 | ((U32)Intens << 24);
	DMA2D->BGPFCCR = LTDC_PIXEL_FORMAT_ARGB8888
				 | (0UL << 16)
				 | ((U32)(255 - Intens) << 24);
	DMA2D->OPFCCR  = LTDC_PIXEL_FORMAT_ARGB8888;
	DMA2D->NLR     = (U32)(NumItems << 16) | 1;

	/* 启动传输 */
	DMA2D->CR   |= DMA2D_CR_START;   

	/* 等待DMA2D传输完成 */
	while (DMA2D->CR & DMA2D_CR_START) {} 
}

/*
*********************************************************************************************************
*	函 数 名: _DMA_ConvertColor
*	功能说明: 颜色格式转换
*	形    参: pSrc             源数据地址
*             pDst             目的数据地址
*             PixelFormatSrc   源数据颜色格式
*             PixelFormatDst   转换的颜色格式
*             NumItems         转换次数
*	返 回 值: 无
*********************************************************************************************************
*/
static void _DMA_ConvertColor(void * pSrc, void * pDst,  U32 PixelFormatSrc, U32 PixelFormatDst, U32 NumItems) 
{
	/* 配置DMA2D */
	DMA2D->CR      = 0x00010000UL | (1 << 9);
	DMA2D->FGMAR   = (U32)pSrc;
	DMA2D->OMAR    = (U32)pDst;
	DMA2D->FGOR    = 0;
	DMA2D->OOR     = 0;
	DMA2D->FGPFCCR = PixelFormatSrc;
	DMA2D->OPFCCR  = PixelFormatDst;
	DMA2D->NLR     = (U32)(NumItems << 16) | 1;

	/* 启动传输 */
	DMA2D->CR   |= DMA2D_CR_START;   

	/* 等待DMA2D传输完成 */
	while (DMA2D->CR & DMA2D_CR_START) {} 
}

/*
*********************************************************************************************************
*	函 数 名: _DMA_DrawBitmapL8
*	功能说明: 绘制L8格式位图
*	形    参: pSrc             源数据地址
*             pDst             目的数据地址
*             OffSrc           源数据行偏移
*             OffDst           目的数据行偏移
*             PixelFormatDst   转换的颜色格式
*             xSize            位图长
*             ySize            位图高
*	返 回 值: 无
*********************************************************************************************************
*/
static void _DMA_DrawBitmapL8(void * pSrc, void * pDst,  U32 OffSrc, U32 OffDst, U32 PixelFormatDst, U32 xSize, U32 ySize) 
{
	/* 配置DMA2D */
	DMA2D->CR      = 0x00010000UL | (1 << 9);
	DMA2D->FGMAR   = (U32)pSrc;
	DMA2D->OMAR    = (U32)pDst;
	DMA2D->FGOR    = OffSrc;
	DMA2D->OOR     = OffDst;
	DMA2D->FGPFCCR = LTDC_PIXEL_FORMAT_L8;
	DMA2D->OPFCCR  = PixelFormatDst;
	DMA2D->NLR     = (U32)(xSize << 16) | ySize;

	/* 启动传输 */
	DMA2D->CR   |= DMA2D_CR_START;   

	/* 等待DMA2D传输完成 */
	while (DMA2D->CR & DMA2D_CR_START) {}  
}

#if DrawBitmapA4Enalbe == 1
/*
*********************************************************************************************************
*	函 数 名: _DMA_DrawBitmapA4
*	功能说明: 绘制A4格式位图
*	形    参: pSrc             源数据地址
*             pDst             目的数据地址
*             OffSrc           源数据行偏移
*             OffDst           目的数据行偏移
*             PixelFormatDst   转换的颜色格式
*             xSize            位图长
*             ySize            位图高
*	返 回 值: 0
*********************************************************************************************************
*/
static int _DMA_DrawBitmapA4(void * pSrc, void * pDst,  U32 OffSrc, U32 OffDst, U32 PixelFormatDst, U32 xSize, U32 ySize) 
{
	U8 * pRD;
	U8 * pWR;
	U32 NumBytes, Color, Index;

	NumBytes = ((xSize + 1) & ~1) * ySize;
	if ((NumBytes > sizeof(_aBuffer)) || (NumBytes == 0)) 
	{
		return 1;
	}
	
	pWR = (U8 *)_aBuffer;
	pRD = (U8 *)pSrc;
	do 
	{
		*pWR++ = _aMirror[*pRD++];
	} while (--NumBytes);

	Index = LCD_GetColorIndex();
	Color = LCD_Index2Color(Index);

	/* 配置DMA2D */
	DMA2D->CR = 0x00020000UL;
	DMA2D->FGCOLR  = ((Color & 0xFF) << 16)
			       |  (Color & 0xFF00)
			       | ((Color >> 16) & 0xFF);
	DMA2D->FGMAR   = (U32)_aBuffer;
	DMA2D->FGOR    = 0;
	DMA2D->FGPFCCR = 0xA;
	DMA2D->NLR     = (U32)((xSize + OffSrc) << 16) | ySize;
	DMA2D->BGMAR   = (U32)pDst;
	DMA2D->BGOR    = OffDst - OffSrc;
	DMA2D->BGPFCCR = PixelFormatDst;
	DMA2D->OMAR    = DMA2D->BGMAR;
	DMA2D->OOR     = DMA2D->BGOR;
	DMA2D->OPFCCR  = DMA2D->BGPFCCR;

	/* 启动传输 */
	DMA2D->CR   |= DMA2D_CR_START;   

	/* 等待DMA2D传输完成 */
	while (DMA2D->CR & DMA2D_CR_START) {} 

	return 0;
}
#endif

/*
*********************************************************************************************************
*	函 数 名: _DMA_DrawAlphaBitmap
*	功能说明: 绘制带透明通道的位图
*	形    参: pSrc             源数据地址
*             pDst             目的数据地址
*             xSize            位图长
*             ySize            位图高
*             OffLineSrc       源数据行偏移
*             OffLineDst       目的数据行偏移
*             PixelFormatDst   转换的颜色格式
*	返 回 值: 0
*********************************************************************************************************
*/
static void _DMA_DrawAlphaBitmap(void * pDst, const void * pSrc, int xSize, int ySize, int OffLineSrc, int OffLineDst, int PixelFormat) 
{
	/* 配置*/ 
	DMA2D->CR      = 0x00020000UL | (1 << 9);
	DMA2D->FGMAR   = (U32)pSrc;
	DMA2D->BGMAR   = (U32)pDst;
	DMA2D->OMAR    = (U32)pDst;
	DMA2D->FGOR    = OffLineSrc;
	DMA2D->BGOR    = OffLineDst;
	DMA2D->OOR     = OffLineDst;
	DMA2D->FGPFCCR = LTDC_PIXEL_FORMAT_ARGB8888;
	DMA2D->BGPFCCR = PixelFormat;
	DMA2D->OPFCCR  = PixelFormat;
	DMA2D->NLR     = (U32)(xSize << 16) | (U16)ySize;

	/* 启动传输 */
	DMA2D->CR   |= DMA2D_CR_START;   

	/* 等待DMA2D传输完成 */
	while (DMA2D->CR & DMA2D_CR_START) {} 
}

/*
*********************************************************************************************************
*	函 数 名: _DMA_LoadLUT
*	功能说明: 加载颜色表
*	形    参: pColor     颜色表地址
*             NumItems   要加载的个数
*	返 回 值: 0
*********************************************************************************************************
*/
static void _DMA_LoadLUT(LCD_COLOR * pColor, U32 NumItems)
{
	/* 配置DMA2D */
	DMA2D->FGCMAR  = (U32)pColor;
	DMA2D->FGPFCCR  = LTDC_PIXEL_FORMAT_RGB888
				  | ((NumItems - 1) & 0xFF) << 8;
	
	/* 启动加载 */
	DMA2D->FGPFCCR |= (1 << 5);
}

