ZGHVER/stm32h750/emwin/emWin/Config/LCDConf_Lin_Template.c
/*
*********************************************************************************************************
*	函 数 名: _DMA_AlphaBlending
*	功能说明: 前景层和背景层混合输出
*	形    参: pColorFG    前景层颜色数据地址
*             pColorBG    背景层颜色数据地址
*             pColorDst   输出目标区地址
*             NumItems    转换次数
*	返 回 值: 无
*********************************************************************************************************
*/
static void _DMA_AlphaBlending(LCD_COLOR * pColorFG, LCD_COLOR * pColorBG, LCD_COLOR * pColorDst, U32 NumItems) 
{
	_DMA_AlphaBlendingBulk(pColorFG, pColorBG, pColorDst, NumItems);
}

/*
*********************************************************************************************************
*	函 数 名: _DMA_Index2ColorBulk
*	功能说明: 通过DMA2D，将当前显示屏的颜色数据转换为emWin的32位ARGB颜色数据。
*	形    参: pIndex       显示屏颜色地址
*             pColor       转换成适用于emWin的颜色地址
*             NumItems     转换的颜色数量
*             SizeOfIndex  未使用
*             PixelFormat  显示屏当前使用的颜色格式
*	返 回 值: 无
*********************************************************************************************************
*/
static void _DMA_Index2ColorBulk(void * pIndex, LCD_COLOR * pColor, U32 NumItems, U8 SizeOfIndex, U32 PixelFormat) 
{
	_DMA_ConvertColor(pIndex, pColor, PixelFormat, LTDC_PIXEL_FORMAT_ARGB8888, NumItems);
}

/*
*********************************************************************************************************
*	函 数 名: _DMA_Color2IndexBulk
*	功能说明: 通过DMA2D，将emWin的32位ARGB颜色数据转换为适用于当前显示屏的颜色数据
*	形    参: pIndex       显示屏颜色地址
*             pColor       转换成适用于emWin的颜色地址
*             NumItems     转换的颜色数量
*             SizeOfIndex  未使用
*             PixelFormat  显示屏当前使用的颜色格式
*	返 回 值: 无
*********************************************************************************************************
*/
static void _DMA_Color2IndexBulk(LCD_COLOR * pColor, void * pIndex, U32 NumItems, U8 SizeOfIndex, U32 PixelFormat)
{
	_DMA_ConvertColor(pColor, pIndex, LTDC_PIXEL_FORMAT_ARGB8888, PixelFormat, NumItems);
}

/*
*********************************************************************************************************
*	函 数 名: _DMA_MixColorsBulk
*	功能说明: 将一块显示区的前景色和背景色进行混合
*	形    参: pFG   前景色地址
*             pBG   背景色地址
*             pDst  混合后颜色存储的地址
*             OffFG    前景色偏移地址
*             OffBG    背景色偏移地址
*             OffDest  混合后偏移地址
*             xSize    显示区x轴大小
*             ySize    显示区y轴大小
*             Intens   即alpha值
*	返 回 值: 无
*********************************************************************************************************
*/
static void _LCD_MixColorsBulk(U32 * pFG, U32 * pBG, U32 * pDst, unsigned OffFG, unsigned OffBG, unsigned OffDest, unsigned xSize, unsigned ySize, U8 Intens) 
{
	int y;

	GUI_USE_PARA(OffFG);
	GUI_USE_PARA(OffDest);

	for (y = 0; y < ySize; y++) 
	{
		_DMA_MixColorsBulk(pFG, pBG, pDst, Intens, xSize);
		pFG  += xSize + OffFG;
		pBG  += xSize + OffBG;
		pDst += xSize + OffDest;
	}
}

/*
*********************************************************************************************************
*	函 数 名: _GetBufferSize
*	功能说明: 获取指定层显存大小
*	形    参: LayerIndex    图层
*	返 回 值: 显存大小
*********************************************************************************************************
*/
static U32 _GetBufferSize(int LayerIndex) 
{
	U32 BufferSize;

	BufferSize = _axSize[LayerIndex] * _aySize[LayerIndex] * _aBytesPerPixels[LayerIndex];

	return BufferSize;
}

/*
*********************************************************************************************************
*	函 数 名: _LCD_CopyBuffer
*	功能说明: 此函数用于多缓冲，将一个缓冲中的所有数据复制到另一个缓冲。
*	形    参: LayerIndex    图层
*             IndexSrc      源缓冲序号
*             IndexDst      目标缓冲序号
*	返 回 值: 无
*********************************************************************************************************
*/
static void _LCD_CopyBuffer(int LayerIndex, int IndexSrc, int IndexDst) 
{
	U32 BufferSize, AddrSrc, AddrDst;

	BufferSize = _GetBufferSize(LayerIndex);
	AddrSrc    = _aAddr[LayerIndex] + BufferSize * IndexSrc;
	AddrDst    = _aAddr[LayerIndex] + BufferSize * IndexDst;
	_DMA_Copy(LayerIndex, (void *)AddrSrc, (void *)AddrDst, _axSize[LayerIndex], _aySize[LayerIndex], 0, 0);
	
	/* 绘制操作切换到缓冲Buffer[IndexDst] */
	_aBufferIndex[LayerIndex] = IndexDst;
}

/*
*********************************************************************************************************
*	函 数 名: _LCD_CopyRect
*	功能说明: 此函数用于多缓冲，将一个缓冲中指定区域数据复制到另一个缓冲。
*	形    参: LayerIndex    图层
*             x0            源缓冲x轴位置
*             y0            源缓冲y轴位置
*             x1            目标冲x轴位置
*             y1            目标冲y轴位置
*             xSize         要复制的x轴大小
*             ySize         要复制的y轴大小
*	返 回 值: 无
*********************************************************************************************************
*/
static void _LCD_CopyRect(int LayerIndex, int x0, int y0, int x1, int y1, int xSize, int ySize)
{
	U32 BufferSize, AddrSrc, AddrDst;
	int OffLine;

	BufferSize = _GetBufferSize(LayerIndex);
	AddrSrc = _aAddr[LayerIndex] + BufferSize * _aBufferIndex[LayerIndex] + (y0 * _axSize[LayerIndex] + x0) * _aBytesPerPixels[LayerIndex];
	AddrDst = _aAddr[LayerIndex] + BufferSize * _aBufferIndex[LayerIndex] + (y1 * _axSize[LayerIndex] + x1) * _aBytesPerPixels[LayerIndex];
	OffLine = _axSize[LayerIndex] - xSize;
	_DMA_Copy(LayerIndex, (void *)AddrSrc, (void *)AddrDst, xSize, ySize, OffLine, OffLine);
}

/*
*********************************************************************************************************
*	函 数 名: _LCD_FillRect
*	功能说明: 对指定的区域进行颜色填充
*	形    参: LayerIndex    图层
*             x0            起始x轴位置
*             y0            起始y轴位置
*             x1            结束x轴位置
*             y1            结束y轴位置
*             PixelIndex    要填充的颜色值
*	返 回 值: 无
*********************************************************************************************************
*/
static void _LCD_FillRect(int LayerIndex, int x0, int y0, int x1, int y1, U32 PixelIndex) 
{
	U32 BufferSize, AddrDst;
	int xSize, ySize;

	if (GUI_GetDrawMode() == GUI_DM_XOR) 
	{
		LCD_SetDevFunc(LayerIndex, LCD_DEVFUNC_FILLRECT, NULL);
		LCD_FillRect(x0, y0, x1, y1);
		LCD_SetDevFunc(LayerIndex, LCD_DEVFUNC_FILLRECT, (void(*)(void))_LCD_FillRect);
	}
	else
	{
		xSize = x1 - x0 + 1;
		ySize = y1 - y0 + 1;
		BufferSize = _GetBufferSize(LayerIndex);
		AddrDst = _aAddr[LayerIndex] + BufferSize * _aBufferIndex[LayerIndex] + (y0 * _axSize[LayerIndex] + x0) * _aBytesPerPixels[LayerIndex];
		_DMA_Fill(LayerIndex, (void *)AddrDst, xSize, ySize, _axSize[LayerIndex] - xSize, PixelIndex);
	}
}

