ZGHVER/stm32h750/emwin/emWin/Config/LCDConf_Lin_Template.c
/*
*********************************************************************************************************
*	函 数 名: _LCD_DrawBitmap32bpp
*	功能说明: 绘制32bpp格式位图
*	形    参: LayerIndex      图层   
*             x               X轴起始位置
*             y               Y轴起始位置
*             p               源数据地址
*             xSize           位图长
*             ySize           位图高
*             BytesPerLine    每行字节数
*	返 回 值: 无
*********************************************************************************************************
*/
static void _LCD_DrawBitmap32bpp(int LayerIndex, int x, int y, U16 const * p, int xSize, int ySize, int BytesPerLine) 
{
	U32 BufferSize, AddrDst;
	int OffLineSrc, OffLineDst;

	BufferSize = _GetBufferSize(LayerIndex);
	AddrDst = _aAddr[LayerIndex] + BufferSize * _aBufferIndex[LayerIndex] + (y * _axSize[LayerIndex] + x) * _aBytesPerPixels[LayerIndex];
	OffLineSrc = (BytesPerLine / 4) - xSize;
	OffLineDst = _axSize[LayerIndex] - xSize;
	_DMA_Copy(LayerIndex, (void *)p, (void *)AddrDst, xSize, ySize, OffLineSrc, OffLineDst);
}

/*
*********************************************************************************************************
*	函 数 名: _LCD_DrawBitmap16bpp
*	功能说明: 绘制16bpp格式位图
*	形    参: LayerIndex      图层   
*             x               X轴起始位置
*             y               Y轴起始位置
*             p               源数据地址
*             xSize           位图长
*             ySize           位图高
*             BytesPerLine    每行字节数
*	返 回 值: 无
*********************************************************************************************************
*/
void _LCD_DrawBitmap16bpp(int LayerIndex, int x, int y, U16 const * p, int xSize, int ySize, int BytesPerLine) 
{
	U32 BufferSize, AddrDst;
	int OffLineSrc, OffLineDst;

	BufferSize = _GetBufferSize(LayerIndex);
	AddrDst = _aAddr[LayerIndex] + BufferSize * _aBufferIndex[LayerIndex] + (y * _axSize[LayerIndex] + x) * _aBytesPerPixels[LayerIndex];
	OffLineSrc = (BytesPerLine / 2) - xSize;
	OffLineDst = _axSize[LayerIndex] - xSize;
	_DMA_Copy(LayerIndex, (void *)p, (void *)AddrDst, xSize, ySize, OffLineSrc, OffLineDst);
}

/*
*********************************************************************************************************
*	函 数 名: _LCD_DrawBitmap8bpp
*	功能说明: 绘制8bpp格式位图
*	形    参: LayerIndex      图层   
*             x               X轴起始位置
*             y               Y轴起始位置
*             p               源数据地址
*             xSize           位图长
*             ySize           位图高
*             BytesPerLine    每行字节数
*	返 回 值: 无
*********************************************************************************************************
*/
static void _LCD_DrawBitmap8bpp(int LayerIndex, int x, int y, U8 const * p, int xSize, int ySize, int BytesPerLine) {
	U32 BufferSize, AddrDst;
	int OffLineSrc, OffLineDst;
	U32 PixelFormat;

	PixelFormat = _GetPixelformat(LayerIndex);
	BufferSize = _GetBufferSize(LayerIndex);
	AddrDst = _aAddr[LayerIndex] + BufferSize * _aBufferIndex[LayerIndex] + (y * _axSize[LayerIndex] + x) * _aBytesPerPixels[LayerIndex];
	OffLineSrc = BytesPerLine - xSize;
	OffLineDst = _axSize[LayerIndex] - xSize;
	_DMA_DrawBitmapL8((void *)p, (void *)AddrDst, OffLineSrc, OffLineDst, PixelFormat, xSize, ySize);
}

#if DrawBitmapA4Enalbe == 1
/*
*********************************************************************************************************
*	函 数 名: _LCD_DrawBitmap4bpp
*	功能说明: 绘制4bpp格式位图
*	形    参: LayerIndex      图层   
*             x               X轴起始位置
*             y               Y轴起始位置
*             p               源数据地址
*             xSize           位图长
*             ySize           位图高
*             BytesPerLine    每行字节数
*	返 回 值: 无
*********************************************************************************************************
*/
static int _LCD_DrawBitmap4bpp(int LayerIndex, int x, int y, U8 const * p, int xSize, int ySize, int BytesPerLine) {
	U32 BufferSize, AddrDst;
	int OffLineSrc, OffLineDst;
	U32 PixelFormat;

	if (x < 0) 
	{
		return 1;
	}
	
	if ((x + xSize) >= _axSize[LayerIndex]) 
	{
		return 1;
	}
	
	if (y < 0) 
	{
		return 1;
	}
	
	if ((y + ySize) >= _aySize[LayerIndex]) 
	{
		return 1;
	}
	
	PixelFormat = _GetPixelformat(LayerIndex);

	if (PixelFormat > LTDC_PIXEL_FORMAT_ARGB4444) 
	{
		return 1;
	}
	
	BufferSize = _GetBufferSize(LayerIndex);
	AddrDst = _aAddr[LayerIndex] + BufferSize * _aBufferIndex[LayerIndex] + (y * _axSize[LayerIndex] + x) * _aBytesPerPixels[LayerIndex];
	OffLineSrc = (BytesPerLine * 2) - xSize;
	OffLineDst = _axSize[LayerIndex] - xSize;
	return _DMA_DrawBitmapA4((void *)p, (void *)AddrDst, OffLineSrc, OffLineDst, PixelFormat, xSize, ySize);;
}
#endif

/*
*********************************************************************************************************
*	函 数 名: _LCD_DrawMemdev16bpp
*	功能说明: 绘制16bpp存储设备
*	形    参: pDst               源数据地址   
*             pSrc               目的数据地址
*             xSize              存储设备长
*             ySize              存储设备高
*             BytesPerLineDst    源数据每行字节数
*             BytesPerLineSrc    目的数据每行字节数
*	返 回 值: 无
*********************************************************************************************************
*/
static void _LCD_DrawMemdev16bpp(void * pDst, const void * pSrc, int xSize, int ySize, int BytesPerLineDst, int BytesPerLineSrc) 
{
	int OffLineSrc, OffLineDst;

	OffLineSrc = (BytesPerLineSrc / 2) - xSize;
	OffLineDst = (BytesPerLineDst / 2) - xSize;
	_DMA_CopyRGB565(pSrc, pDst, xSize, ySize, OffLineSrc, OffLineDst);
}

/*
*********************************************************************************************************
*	函 数 名: _LCD_DrawMemdevAlpha
*	功能说明: 绘制带Alpha通道的存储设备
*	形    参: pDst               源数据地址   
*             pSrc               目的数据地址
*             xSize              存储设备长
*             ySize              存储设备高
*             BytesPerLineDst    源数据每行字节数
*             BytesPerLineSrc    目的数据每行字节数
*	返 回 值: 无
*********************************************************************************************************
*/
static void _LCD_DrawMemdevAlpha(void * pDst, const void * pSrc, int xSize, int ySize, int BytesPerLineDst, int BytesPerLineSrc) 
{
	int OffLineSrc, OffLineDst;

