ZGHVER/stm32h750/emwin/emWin/Config/LCDConf_Lin_Template.c
	OffLineSrc = (BytesPerLineSrc / 4) - xSize;
	OffLineDst = (BytesPerLineDst / 4) - xSize;
	_DMA_DrawAlphaBitmap(pDst, pSrc, xSize, ySize, OffLineSrc, OffLineDst, LTDC_PIXEL_FORMAT_ARGB8888);
}

/*
*********************************************************************************************************
*	函 数 名: _LCD_DrawBitmapAlpha
*	功能说明: 绘制带Alpha通道的位图
*	形    参: LayerIndex      图层   
*             x               X轴起始位置
*             y               Y轴起始位置
*             p               源数据地址
*             xSize           位图长
*             ySize           位图高
*             BytesPerLine    每行字节数
*	返 回 值: 无
*********************************************************************************************************
*/
static void _LCD_DrawBitmapAlpha(int LayerIndex, int x, int y, const void * p, int xSize, int ySize, int BytesPerLine) 
{
	U32 BufferSize, AddrDst;
	int OffLineSrc, OffLineDst;
	U32 PixelFormat;

	PixelFormat = _GetPixelformat(LayerIndex);
	BufferSize = _GetBufferSize(LayerIndex);
	AddrDst = _aAddr[LayerIndex] + BufferSize * _aBufferIndex[LayerIndex] + (y * _axSize[LayerIndex] + x) * _aBytesPerPixels[LayerIndex];
	OffLineSrc = (BytesPerLine / 4) - xSize;
	OffLineDst = _axSize[LayerIndex] - xSize;
	_DMA_DrawAlphaBitmap((void *)AddrDst, p, xSize, ySize, OffLineSrc, OffLineDst, PixelFormat);
}

/*
*********************************************************************************************************
*	函 数 名: _LCD_GetpPalConvTable
*	功能说明: 转换颜色板以适应控制器设置的颜色格式。
*	形    参: pLogPal   源颜色板地址
*             pBitmap   位图地址
*             LayerIndex  源颜色格式
*	返 回 值: 转换后的颜色板地址
*********************************************************************************************************
*/
static LCD_PIXELINDEX * _LCD_GetpPalConvTable(const LCD_LOGPALETTE GUI_UNI_PTR * pLogPal, const GUI_BITMAP GUI_UNI_PTR * pBitmap, int LayerIndex) 
{
	void (* pFunc)(void);
	int DoDefault = 0;

	/* 8bpp */
	if (pBitmap->BitsPerPixel == 8) 
	{
		pFunc = LCD_GetDevFunc(LayerIndex, LCD_DEVFUNC_DRAWBMP_8BPP);
		if (pFunc) 
		{
			if (pBitmap->pPal) 
			{
				if (pBitmap->pPal->HasTrans) 
				{
					DoDefault = 1;
				}
			}
			else
			{
				DoDefault = 1;
			}
		}
		else
		{
			DoDefault = 1;
		}
	}
	else 
	{
	DoDefault = 1;
	}

	/* 默认颜色板管理 */
	if (DoDefault) 
	{
		/* 返回索引值 */
		return LCD_GetpPalConvTable(pLogPal);
	}

	/* DMA2D加载LUT */
	_DMA_LoadLUT((U32 *)pLogPal->pPalEntries, pLogPal->NumEntries);

	/* 返回非NULL */
	return _pBuffer_DMA2D;
}

/*
*********************************************************************************************************
*	函 数 名: LCD_X_DisplayDriver
*	功能说明: 显示驱动设置
*	形    参: LayerIndex   图层
*             Cmd          命令
*             pData        数据地址
*	返 回 值: 成功返回0，失败返回-1
*********************************************************************************************************
*/
int LCD_X_DisplayDriver(unsigned LayerIndex, unsigned Cmd, void * pData) 
{
	int r = 0;
	U32 addr;

	switch (Cmd) 
	{
		case LCD_X_INITCONTROLLER: 
		{
			/* 驱动初始化 */
			LCD_LL_LayerInit(LayerIndex);
			break;
		}
		
		case LCD_X_SETORG: 
		{
			/* 设置显存地址 */
			LCD_X_SETORG_INFO * p;

			p = (LCD_X_SETORG_INFO *)pData;
			addr = _aAddr[LayerIndex] + p->yPos * _axSize[LayerIndex] * _aBytesPerPixels[LayerIndex];
			HAL_LTDC_SetAddress(&hltdc, addr, LayerIndex);
			break;
		}
		
		case LCD_X_SHOWBUFFER: 
		{
			/* 用于多缓冲，参数Index用于指示使用的那个缓冲 */
			LCD_X_SHOWBUFFER_INFO * p;

			p = (LCD_X_SHOWBUFFER_INFO *)pData;
			_aPendingBuffer[LayerIndex] = p->Index;
			break;
		}
		
		case LCD_X_SETLUTENTRY: 
		{
			/* 颜色查找表设置 */
			LCD_X_SETLUTENTRY_INFO * p;

			p = (LCD_X_SETLUTENTRY_INFO *)pData;
			HAL_LTDC_ConfigCLUT(&hltdc, (uint32_t*)p->Color, p->Pos, LayerIndex);
			break;
		}
		
		case LCD_X_ON: 
		{
			/* 使能LTDC  */
			__HAL_LTDC_ENABLE(&hltdc);
			break;
		}
		
		case LCD_X_OFF: 
		{
			/* 关闭LTDC */
			__HAL_LTDC_DISABLE(&hltdc);
			break;
		}
		
		case LCD_X_SETVIS: 
		{
			/* 图层的开关 */
			LCD_X_SETVIS_INFO * p;

			p = (LCD_X_SETVIS_INFO *)pData;
			if(p->OnOff == ENABLE )
			{
				__HAL_LTDC_LAYER_ENABLE(&hltdc, LayerIndex); 
			}
			else
			{
				__HAL_LTDC_LAYER_DISABLE(&hltdc, LayerIndex);
			}
			
			__HAL_LTDC_RELOAD_IMMEDIATE_CONFIG(&hltdc);
			break;
		}
		
		case LCD_X_SETPOS:
		{
			/* 设置图层显示位置 */
			LCD_X_SETPOS_INFO * p;

			p = (LCD_X_SETPOS_INFO *)pData;    
			HAL_LTDC_SetWindowPosition(&hltdc, p->xPos, p->yPos, LayerIndex);
			break;
		}
		
		case LCD_X_SETSIZE:
		{
			/* 设置图层大小 */
			LCD_X_SETSIZE_INFO * p;
			int xPos, yPos;

			GUI_GetLayerPosEx(LayerIndex, &xPos, &yPos);
			p = (LCD_X_SETSIZE_INFO *)pData;
			if (LCD_GetSwapXYEx(LayerIndex))
			{
				_axSize[LayerIndex] = p->ySize;
				_aySize[LayerIndex] = p->xSize;
			}
			else
			{
				_axSize[LayerIndex] = p->xSize;
				_aySize[LayerIndex] = p->ySize;
			}
			
			HAL_LTDC_SetWindowPosition(&hltdc, xPos, yPos, LayerIndex);
			break;
		}
		
		case LCD_X_SETALPHA: 
		{
			/* 设置透明 */
			LCD_X_SETALPHA_INFO * p;

			p = (LCD_X_SETALPHA_INFO *)pData;
			HAL_LTDC_SetAlpha(&hltdc, p->Alpha, LayerIndex);
			break;
		}
		
		case LCD_X_SETCHROMAMODE: 
		{
			/* 使能或禁止扣色 */
			LCD_X_SETCHROMAMODE_INFO * p;

			p = (LCD_X_SETCHROMAMODE_INFO *)pData;
			if(p->ChromaMode != 0)
			{
				HAL_LTDC_EnableColorKeying(&hltdc, LayerIndex);
			}
			else
			{
				HAL_LTDC_DisableColorKeying(&hltdc, LayerIndex);      
			}
			break;
		}
		
		case LCD_X_SETCHROMA: 
		{
			/* 设置扣色 */
			LCD_X_SETCHROMA_INFO * p;
			U32 Color;

			p = (LCD_X_SETCHROMA_INFO *)pData;
			Color = ((p->ChromaMin & 0xFF0000) >> 16) | (p->ChromaMin & 0x00FF00) | ((p->ChromaMin & 0x0000FF) << 16);
			HAL_LTDC_ConfigColorKeying(&hltdc, Color, LayerIndex);
			break;
		}
		
		default:
			r = -1;
			break;
	}

	return r;
}

/*
*********************************************************************************************************
*	函 数 名: LCD_X_DisplayDriver
*	功能说明: 初始化配置
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void LCD_X_Config(void) 
{
	int i;
	U32 PixelFormat;

	/* 底层初始化 */
	LCD_LL_Init ();

	#if ClearCacheHookEnalbe == 1
		GUI_DCACHE_SetClearCacheHook(_ClearCacheHook);
	#endif

	/* 初始化多缓冲 */
	#if (NUM_BUFFERS > 1)
	for (i = 0; i < GUI_NUM_LAYERS; i++) 
	{
		GUI_MULTIBUF_ConfigEx(i, NUM_BUFFERS);
	}
	#endif

	/* 设置显示驱动和颜色格式转换 */
	GUI_DEVICE_CreateAndLink(DISPLAY_DRIVER_0, COLOR_CONVERSION_0, 0, 0);

	/* 设置图层1 */
	if (LCD_GetSwapXYEx(0)) 
	{
		LCD_SetSizeEx (0,  g_LcdHeight, g_LcdWidth);
		LCD_SetVSizeEx(0,  g_LcdHeight * NUM_VSCREENS, g_LcdWidth);
	}
	else
	{
		LCD_SetSizeEx (0, g_LcdWidth, g_LcdHeight);
		LCD_SetVSizeEx(0, g_LcdWidth, g_LcdHeight * NUM_VSCREENS);
	}
	
	#if (GUI_NUM_LAYERS > 1)
	/* 设置显示驱动和颜色格式转换 */
	GUI_DEVICE_CreateAndLink(DISPLAY_DRIVER_1, COLOR_CONVERSION_1, 0, 1);

	/* 设置图层2 */
	if (LCD_GetSwapXYEx(1)) 
	{
		LCD_SetSizeEx (1, g_LcdHeight, g_LcdWidth);
		LCD_SetVSizeEx(1,  g_LcdHeight * NUM_VSCREENS, g_LcdWidth);
	}
	else 
	{
		LCD_SetSizeEx (1, g_LcdWidth, g_LcdHeight);
		LCD_SetVSizeEx(1, g_LcdWidth, g_LcdHeight * NUM_VSCREENS);
	}
	#endif
	
	/* 设置RAM地址和每个像素的字节数 */
	for (i = 0; i < GUI_NUM_LAYERS; i++) 
	{
		/* 设置RAM地址 */
		LCD_SetVRAMAddrEx(i, (void *)(_aAddr[i]));
		
		/* 每个像素的字节数 */
		_aBytesPerPixels[i] = LCD_GetBitsPerPixelEx(i) >> 3;
	}
	
	/* 设置函数重定向 */
	for (i = 0; i < GUI_NUM_LAYERS; i++) 
	{
		PixelFormat = _GetPixelformat(i);
		
