ZGHVER/stm32h750/emwin/emWin/Config/LCDConf_Lin_Template.c
		/* CopyBuffer重定向，多缓冲使用 */
		LCD_SetDevFunc(i, LCD_DEVFUNC_COPYBUFFER, (void(*)(void))_LCD_CopyBuffer);

		if (PixelFormat <= LTDC_PIXEL_FORMAT_ARGB4444) 
		{
			/* 填充使用 */
			LCD_SetDevFunc(i, LCD_DEVFUNC_FILLRECT, (void(*)(void))_LCD_FillRect);
		}

		if (_aOrientation[i] == ROTATION_0)
		{
			/* CopyRect重定向 */
			LCD_SetDevFunc(i, LCD_DEVFUNC_COPYRECT, (void(*)(void))_LCD_CopyRect);

			/* 8bpp重定向 */
			if (PixelFormat <= LTDC_PIXEL_FORMAT_ARGB4444) 
			{
				LCD_SetDevFunc(i, LCD_DEVFUNC_DRAWBMP_8BPP, (void(*)(void))_LCD_DrawBitmap8bpp);
			}

			/* 16bpp重定向 */
			if (PixelFormat == LTDC_PIXEL_FORMAT_RGB565) 
			{
				LCD_SetDevFunc(i, LCD_DEVFUNC_DRAWBMP_16BPP, (void(*)(void))_LCD_DrawBitmap16bpp);
			}

			/* 32bpp重定向 */
			if (PixelFormat == LTDC_PIXEL_FORMAT_ARGB8888) 
			{
				LCD_SetDevFunc(i, LCD_DEVFUNC_DRAWBMP_32BPP, (void(*)(void))_LCD_DrawBitmap32bpp);
			}
		}
	}
	/* DMA2D for ARGB1555 */
	GUICC_M1555I_SetCustColorConv(_Color2IndexBulk_M1555I_DMA2D, _Index2ColorBulk_M1555I_DMA2D);

	/* DMA2D for RGB565 */  
	GUICC_M565_SetCustColorConv  (_Color2IndexBulk_M565_DMA2D,   _Index2ColorBulk_M565_DMA2D);

	/* DMA2D for ARGB4444 */
	GUICC_M4444I_SetCustColorConv(_Color2IndexBulk_M4444I_DMA2D, _Index2ColorBulk_M4444I_DMA2D);

	/* DMA2D for RGB888 */
	GUICC_M888_SetCustColorConv  (_Color2IndexBulk_M888_DMA2D,   _Index2ColorBulk_M888_DMA2D);

	/* DMA2D for ARGB8888 */
	GUICC_M8888I_SetCustColorConv(_Color2IndexBulk_M8888I_DMA2D, _Index2ColorBulk_M8888I_DMA2D);

	/* Alpha混合重定向 */
	GUI_SetFuncAlphaBlending(_DMA_AlphaBlending);

	GUI_SetFuncGetpPalConvTable(_LCD_GetpPalConvTable);

	/* 颜色混合重定向 */
	GUI_SetFuncMixColorsBulk(_LCD_MixColorsBulk);

	#if DrawBitmapA4Enalbe == 1
	GUI_AA_SetpfDrawCharAA4(_LCD_DrawBitmap4bpp); /* 这个函数有问题，未使用 */
	#endif

	/* 16bpp存储设备重定向 */
	GUI_MEMDEV_SetDrawMemdev16bppFunc(_LCD_DrawMemdev16bpp);

	/* Alpha绘制重定向 */
	GUI_SetFuncDrawAlpha(_LCD_DrawMemdevAlpha, _LCD_DrawBitmapAlpha);
}

#if 1
/*
*********************************************************************************************************
*	函 数 名: LTDC_IRQHandler
*	功能说明: 初始化配置
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void LTDC_IRQHandler(void) 
{
	U32 Addr;
	int i;

	LTDC->ICR = (U32)LTDC_IER_LIE;
	
	for (i = 0; i < GUI_NUM_LAYERS; i++) 
	{
		if (_aPendingBuffer[i] >= 0) 
		{
			/* 计算缓冲地址 */
			Addr = _aAddr[i] + _axSize[i] * _aySize[i] * _aPendingBuffer[i] * _aBytesPerPixels[i];

			/* 更新LTDC寄存器 */	  
			__HAL_LTDC_LAYER(&hltdc, i)->CFBAR = Addr;     
			__HAL_LTDC_RELOAD_IMMEDIATE_CONFIG(&hltdc);   

			/* 告诉emWin使用的缓冲 */
			GUI_MULTIBUF_ConfirmEx(i, _aPendingBuffer[i]);

			/* 清除标志 */
			_aPendingBuffer[i] = -1;
		}
	}
}

#else
/*
*********************************************************************************************************
*	函 数 名: LTDC_IRQHandler
*	功能说明: 初始化配置
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void LTDC_IRQHandler(void)
{
	HAL_LTDC_IRQHandler(&hltdc);
}

void HAL_LTDC_LineEvenCallback(LTDC_HandleTypeDef *hltdc) 
{
	U32 Addr;
	int i;

	for (i = 0; i < GUI_NUM_LAYERS; i++) 
	{
		if (_aPendingBuffer[i] >= 0) 
		{
			/* 计算缓冲地址 */
			Addr = _aAddr[i] + _axSize[i] * _aySize[i] * _aPendingBuffer[i] * _aBytesPerPixels[i];

			/* 更新LTDC寄存器 */	  
			__HAL_LTDC_LAYER(hltdc, i)->CFBAR = Addr;     
			__HAL_LTDC_RELOAD_IMMEDIATE_CONFIG(hltdc);   

			/* 告诉emWin使用的缓冲 */
			GUI_MULTIBUF_ConfirmEx(i, _aPendingBuffer[i]);

			/* 清除标志 */
			_aPendingBuffer[i] = -1;
		}
	}

	/* 重新开启行中断，因为函数HAL_LTDC_IRQHandler里面会关闭 */
	HAL_LTDC_ProgramLineEvent(hltdc, 0);
}

#endif

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
